# CLI tools
brew "aria2"
brew "autojump"
brew "bun" # JS runtime for claude-hud statusline
brew "chezmoi"
brew "coreutils"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "neovim"
brew "rsync"
brew "sox"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "unison"
brew "uv"
brew "wget"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"

# AI and developer apps
cask "claude-code"
cask "codex"
cask "visual-studio-code"

# Desktop apps
cask "cc-switch"
cask "feishu"
cask "google-chrome"
cask "keepassxc"
cask "obsidian"
cask "raycast"
cask "thaw"
cask "warp"
cask "wechat"

# Media apps
cask "iina"
cask "obs"

# System utilities
cask "hammerspoon"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements" # Pkg; may prompt for sudo.
cask "orbstack"
cask "squirrel-app" # Pkg; installs input method under /Library.
cask "the-unarchiver"
cask "zerotier-one" # Pkg; installs system network service.
